app/Models/AdminModel.php

    public function get_admin()
    {
        // Method get_admin: Mengambil data admin dari tabel 'tbl_user' dan mengembalikan hasilnya dalam bentuk array.
        return $this->db->table('tbl_user')->get()->getResultArray();
---
SELECT *
FROM `tbl_user`