app/Models/DataProposalModel.php

SELECT *
FROM `data_proposal`
---
    public function get_dataproposal()
    {
        // Method get_dataproposal: Mengambil data proposal dari tabel 'data_proposal' dan mengembalikan hasilnya dalam bentuk array.
        return $this->db->table('data_proposal')->get()->getResultArray();